Revit 2027 API
FabricationItemFile.IsLoaded Method
 Checks to see if the item file has been loaded into the configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLoaded()
Public Function IsLoaded As Boolean
public:
bool IsLoaded()
member IsLoaded : unit -> bool
Return Value
Boolean
 Returns true if the item file has been loaded into the configuration, false otherwise.
See Also
Reference
FabricationItemFile Class
Autodesk.Revit.DB Namespace